Repository: fstarlike/wp-git-manager
Catalog: languages/git-manager-*.po
Languages: fa_ir

source: WP Git Manager
fa_ir: مدیر گیت وردپرس

source: Professional Git repository management from WordPress admin panel with features like displaying commits, pull, fetch, branch switching, and full RTL language support.
fa_ir: مدیریت حرفه‌ای مخازن گیت از پنل مدیریت وردپرس با قابلیت‌هایی مانند نمایش کامیت‌ها، پول، پوش تغییر برنچ و پشتیبانی کامل از زبان راست به چپ.

source: Farzad Hoseinzadeh
fa_ir: فرزاد حسین‌زاده

source: Git Manager
fa_ir: مدیر گیت

source: Git Manager Settings
fa_ir: تنظیمات مدیر گیت

source: Settings
fa_ir: تنظیمات

source: Plugin Configuration & Permissions
fa_ir: پیکربندی افزونه و مجوزها

source: Dashboard
fa_ir: داشبورد

source: Troubleshooting
fa_ir: عیب‌یابی

source: Automatic Fixes
fa_ir: رفع خودکار مشکلات

source: Enable automatic fixes
fa_ir: فعال‌سازی رفع خودکار مشکلات

source: Allow the plugin to automatically fix filesystem and git issues. Use only on trusted servers.
fa_ir: اجازه دهید افزونه به طور خودکار مشکلات فایل سیستم و گیت را برطرف کند. فقط روی سرورهای مورد اعتماد استفاده کنید.

source: User Access Control
fa_ir: کنترل دسترسی کاربران

source: Allowed User Roles
fa_ir: نقش‌های کاربری مجاز

source: Select which WordPress roles are allowed to use the Git Manager interface. Use Ctrl/Cmd+click to select multiple roles.
fa_ir: انتخاب کنید کدام نقش‌های وردپرس مجاز به استفاده از رابط مدیر گیت هستند. از Ctrl/Cmd+click برای انتخاب چندین نقش استفاده کنید.

source: Ready to Save Changes
fa_ir: آماده برای ذخیره تغییرات

source: Click the button below to apply your settings
fa_ir: برای اعمال تنظیمات خود روی دکمه زیر کلیک کنید

source: Save Settings
fa_ir: ذخیره تنظیمات

source: Settings will be applied immediately
fa_ir: تنظیمات بلافاصله اعمال خواهند شد

source: Ready to start troubleshooting
fa_ir: آماده برای شروع عیب‌یابی

source: Start Troubleshooting
fa_ir: شروع عیب‌یابی

source: Stop
fa_ir: توقف

source: Reset
fa_ir: بازنشانی

source: Git Manager Troubleshooting
fa_ir: عیب‌یابی مدیر گیت

source: Ready to start
fa_ir: آماده برای شروع

source: Troubleshooting completed
fa_ir: عیب‌یابی تکمیل شد

source: Repository Path Check
fa_ir: بررسی مسیر مخزن

source: Verifying repository path exists and is accessible
fa_ir: تأیید وجود و دسترسی مسیر مخزن

source: Git Binary Check
fa_ir: بررسی باینری گیت

source: Checking if Git is installed and accessible
fa_ir: بررسی نصب و دسترسی گیت

source: Git Directory Check
fa_ir: بررسی دایرکتوری گیت

source: Verifying .git directory exists and is valid
fa_ir: تأیید وجود و اعتبار دایرکتوری .git

source: Safe Directory Configuration
fa_ir: پیکربندی دایرکتوری امن

source: Checking and fixing Git safe.directory settings
fa_ir: بررسی و رفع تنظیمات safe.directory گیت

source: File Permissions
fa_ir: مجوزهای فایل

source: Checking repository file permissions and ownership
fa_ir: بررسی مجوزها و مالکیت فایل‌های مخزن

source: SSH Directory Setup
fa_ir: راه‌اندازی دایرکتوری SSH

source: Verifying SSH directory exists and has correct permissions
fa_ir: تأیید وجود دایرکتوری SSH و مجوزهای صحیح

source: SSH Key Detection
fa_ir: تشخیص کلید SSH

source: Checking for SSH private keys and their permissions
fa_ir: بررسی کلیدهای خصوصی SSH و مجوزهای آنها

source: Host Key Verification
fa_ir: تأیید کلید میزبان

source: Checking known_hosts for GitHub/GitLab host keys
fa_ir: بررسی known_hosts برای کلیدهای میزبان GitHub/GitLab

source: Git Configuration
fa_ir: پیکربندی گیت

source: Verifying Git user configuration
fa_ir: تأیید پیکربندی کاربر گیت

source: Remote Connection Test
fa_ir: تست اتصال ریموت

source: Testing connection to remote repository
fa_ir: تست اتصال به مخزن ریموت

source: Failed to check repository path
fa_ir: بررسی مسیر مخزن ناموفق بود

source: Please verify the repository path in settings
fa_ir: لطفاً مسیر مخزن را در تنظیمات تأیید کنید

source: Failed to check Git binary
fa_ir: بررسی باینری گیت ناموفق بود

source: Please ensure Git is installed on the server
fa_ir: لطفاً اطمینان حاصل کنید که گیت روی سرور نصب شده است

source: Failed to check Git directory
fa_ir: بررسی دایرکتوری گیت ناموفق بود

source: Please ensure this is a valid Git repository
fa_ir: لطفاً اطمینان حاصل کنید که این یک مخزن گیت معتبر است

source: Failed to check safe directory
fa_ir: بررسی دایرکتوری امن ناموفق بود

source: Please check Git configuration manually
fa_ir: لطفاً پیکربندی گیت را به صورت دستی بررسی کنید

source: Failed to check permissions
fa_ir: بررسی مجوزها ناموفق بود

source: Please check file permissions manually
fa_ir: لطفاً مجوزهای فایل را به صورت دستی بررسی کنید

source: Failed to check SSH directory
fa_ir: بررسی دایرکتوری SSH ناموفق بود

source: Please check SSH directory manually
fa_ir: لطفاً دایرکتوری SSH را به صورت دستی بررسی کنید

source: SSH key imported successfully
fa_ir: کلید SSH با موفقیت وارد شد

source: SSH key input field not found
fa_ir: فیلد ورودی کلید SSH یافت نشد

source: Theme changed
fa_ir: پوسته تغییر کرد

source: Unknown
fa_ir: نامشخص

source: Repository
fa_ir: مخزن

source: Current path
fa_ir: مسیر فعلی

source: Add Repository
fa_ir: افزودن مخزن

source: Cancel
fa_ir: لغو

source: Browse
fa_ir: مرور

source: Import
fa_ir: وارد کردن

source: Clear
fa_ir: پاک کردن

source: Loading...
fa_ir: در حال بارگذاری...

source: Loading repositories...
fa_ir: در حال بارگذاری مخازن...

source: Loading commits...
fa_ir: در حال بارگذاری کامیت‌ها...

source: Loading branches...
fa_ir: در حال بارگذاری برنچ‌ها...

source: Search branches...
fa_ir: جستجو در برنچ‌ها...

source: Overview
fa_ir: نمای کلی

source: Recent Commits
fa_ir: کامیت‌های اخیر

source: Branches
fa_ir: برنچ‌ها

source: Repository Status
fa_ir: وضعیت مخزن

source: Branch Information
fa_ir: اطلاعات برنچ

source: Recent Changes
fa_ir: تغییرات اخیر

source: Last Commit
fa_ir: آخرین کامیت

source: Recommendations
fa_ir: توصیه‌ها

source: Loading repository status...
fa_ir: در حال بارگذاری وضعیت مخزن...

source: Loading branch information...
fa_ir: در حال بارگذاری اطلاعات برنچ...

source: Loading changes...
fa_ir: در حال بارگذاری تغییرات...

source: Loading commit information...
fa_ir: در حال بارگذاری اطلاعات کامیت...

source: Basic Information
fa_ir: اطلاعات پایه

source: Actions
fa_ir: عملیات

source: Repository Name
fa_ir: نام مخزن

source: Repository Path
fa_ir: مسیر مخزن

source: Remote URL
fa_ir: آدرس ریموت

source: The display name for this repository
fa_ir: نام نمایشی برای این مخزن

source: The local path to this repository
fa_ir: مسیر محلی این مخزن

source: The remote repository URL (optional)
fa_ir: آدرس مخزن ریموت (اختیاری)

source: Repository name
fa_ir: نام مخزن

source: Repository path
fa_ir: مسیر مخزن

source: Pull changes
fa_ir: پول تغییرات

source: Push changes
fa_ir: پوش تغییرات

source: Fetch updates
fa_ir: دریافت به‌روزرسانی‌ها

source: Check status
fa_ir: بررسی وضعیت

source: Professional troubleshooting
fa_ir: عیب‌یابی حرفه‌ای

source: Fix permissions
fa_ir: رفع مجوزها

source: Pull
fa_ir: پول

source: Push
fa_ir: پوش

source: Fetch
fa_ir: دریافت

source: Status
fa_ir: وضعیت

source: Troubleshoot
fa_ir: عیب‌یابی

source: Fix Permissions
fa_ir: رفع مجوزها

source: Current Branch
fa_ir: برنچ فعلی

source: Back to Welcome
fa_ir: بازگشت به خوش‌آمدگویی

source: Add New Repository
fa_ir: افزودن مخزن جدید

source: Repository Information
fa_ir: اطلاعات مخزن

source: Repository URL
fa_ir: آدرس مخزن

source: Local Path
fa_ir: مسیر محلی

source: Branch (Optional)
fa_ir: برنچ (اختیاری)

source: Enter the Git repository URL (HTTPS or SSH) - fields will auto-populate
fa_ir: آدرس مخزن گیت را وارد کنید (HTTPS یا SSH) - فیلدها به طور خودکار پر خواهند شد

source: Select the parent directory where the repository will be cloned
fa_ir: دایرکتوری والد را انتخاب کنید که مخزن در آن کلون خواهد شد

source: Specify a branch to checkout (defaults to main/master)
fa_ir: برنچ‌ای را برای checkout مشخص کنید (پیش‌فرض main/master)

source: Authentication
fa_ir: احراز هویت

source: This is a private repository
fa_ir: این یک مخزن خصوصی است

source: Enable if the repository requires authentication
fa_ir: اگر مخزن نیاز به احراز هویت دارد، فعال کنید

source: Authentication Method
fa_ir: روش احراز هویت

source: SSH Key
fa_ir: کلید SSH

source: Use SSH private key for authentication
fa_ir: از کلید خصوصی SSH برای احراز هویت استفاده کنید

source: HTTPS Token
fa_ir: توکن HTTPS

source: Use username and personal access token
fa_ir: از نام کاربری و توکن دسترسی شخصی استفاده کنید

source: SSH Private Key
fa_ir: کلید خصوصی SSH

source: Import SSH key from file
fa_ir: وارد کردن کلید SSH از فایل

source: Clear SSH key
fa_ir: پاک کردن کلید SSH

source: How to generate SSH key
fa_ir: نحوه تولید کلید SSH

source: Import from file
fa_ir: وارد کردن از فایل

source: Username
fa_ir: نام کاربری

source: Personal Access Token
fa_ir: توکن دسترسی شخصی

source: Your Git hosting service username
fa_ir: نام کاربری سرویس میزبانی گیت شما

source: How to create access token
fa_ir: نحوه ایجاد توکن دسترسی

source: Repository Type
fa_ir: نوع مخزن

source: This is an existing Git repository
fa_ir: این یک مخزن گیت موجود است

source: Enable if the directory already contains a Git repository
fa_ir: اگر دایرکتوری قبلاً شامل یک مخزن گیت است، فعال کنید

source: Welcome to Git Manager
fa_ir: به مدیر گیت خوش آمدید

source: Manage multiple Git repositories with a professional interface inspired by GitHub Desktop and GitLab.
fa_ir: مدیریت چندین مخزن گیت با رابط حرفه‌ای الهام گرفته از GitHub Desktop و GitLab.

source: Add Your First Repository
fa_ir: اولین مخزن خود را اضافه کنید

source: Buy me a coffee
fa_ir: برای من قهوه بخرید

source: Repositories
fa_ir: مخازن

source: Professional Git troubleshooting tool that will diagnose and fix common issues with your Git setup.
fa_ir: ابزار عیب‌یابی حرفه‌ای گیت که مشکلات رایج پیکربندی گیت شما را تشخیص داده و برطرف می‌کند.

source: Run Troubleshooting
fa_ir: اجرای عیب‌یابی

source: Troubleshooting Results
fa_ir: نتایج عیب‌یابی

source: Copy Results
fa_ir: کپی نتایج

source: You don't have access to this section.
fa_ir: شما به این بخش دسترسی ندارید.

source: main
fa_ir: اصلی

source: -----BEGIN OPENSSH PRIVATE KEY-----&#10;Your SSH private key content here...&#10;-----END OPENSSH PRIVATE KEY-----
fa_ir: -----BEGIN OPENSSH PRIVATE KEY-----&#10;محتوای کلید خصوصی SSH شما اینجا...&#10;-----END OPENSSH PRIVATE KEY-----

source: your-username
fa_ir: نام-کاربری-شما

source: Professional Git repository management
fa_ir: مدیریت حرفه‌ای مخازن گیت

source: Toggle RTL/LTR
fa_ir: تغییر راست به چپ/چپ به راست

source: Professional Troubleshooting
fa_ir: عیب‌یابی حرفه‌ای

source: Repository pulled successfully.
fa_ir: مخزن با موفقیت کشیده شد.

source: New commits detected on remote! Please Pull to update your local repository.
fa_ir: کامیت‌های جدید در ریموت شناسایی شد! لطفاً برای به‌روزرسانی مخزن محلی خود پول کنید.

source: New commits on branch
fa_ir: کامیت‌های جدید در برنچ

source: Please Pull to update your local repository or open Git Manager to review changes.
fa_ir: لطفاً برای به‌روزرسانی مخزن محلی خود پول کنید یا مدیر گیت را برای بررسی تغییرات باز کنید.

source: [Git Manager] No remote tracking branch or fetch failed. remote_hash is empty.
fa_ir: [مدیر گیت] هیچ برنچ ردیابی ریموتی وجود ندارد یا دریافت ناموفق بود. remote_hash خالی است.

source: New commits detected on remote!
fa_ir: کامیت‌های جدید در ریموت شناسایی شد!

source: SSH key cleared
fa_ir: کلید SSH پاک شد

source: Repository URL is required
fa_ir: آدرس مخزن الزامی است

source: Local path is required
fa_ir: مسیر محلی الزامی است

source: Failed to load repositories
fa_ir: بارگذاری مخازن ناموفق بود

source: No repository selected
fa_ir: هیچ مخزنی انتخاب نشده است

source: Requesting permission fix...
fa_ir: درخواست رفع مجوزها...

source: Pulling changes...
fa_ir: پول تغییرات...

source: Pushing changes...
fa_ir: پوش تغییرات...

source: Changes pushed successfully
fa_ir: تغییرات با موفقیت پوش شدند

source: Fetching updates...
fa_ir: دریافت به‌روزرسانی‌ها...

source: Checking status...
fa_ir: بررسی وضعیت...

source: Status checked successfully
fa_ir: وضعیت با موفقیت بررسی شد

source: Deleting repository...
fa_ir: حذف مخزن...

source: Re-cloning repository...
fa_ir: کلون مجدد مخزن...

source: Repository settings loaded
fa_ir: تنظیمات مخزن بارگذاری شد

source: Error loading repository settings
fa_ir: خطا در بارگذاری تنظیمات مخزن

source: Settings form not found
fa_ir: فرم تنظیمات یافت نشد

source: Repository name is required
fa_ir: نام مخزن الزامی است

source: Repository path is required
fa_ir: مسیر مخزن الزامی است

source: Invalid repository path
fa_ir: مسیر مخزن نامعتبر است

source: Error refreshing repository list
fa_ir: خطا در به‌روزرسانی لیست مخازن

source: Please select an action type
fa_ir: لطفاً نوع عملیات را انتخاب کنید

source: Failed to read SSH key file
fa_ir: خواندن فایل کلید SSH ناموفق بود

source: Running professional troubleshooting...
fa_ir: در حال اجرای عیب‌یابی حرفه‌ای...

source: Troubleshooting failed
fa_ir: عیب‌یابی ناموفق بود

source: Troubleshooting error
fa_ir: خطای عیب‌یابی

source: Professional Troubleshooting Results
fa_ir: نتایج عیب‌یابی حرفه‌ای

source: Close
fa_ir: بستن

source: Fixing repository permissions...
fa_ir: در حال رفع مجوزهای مخزن...

source: Permissions fixed successfully!
fa_ir: مجوزها با موفقیت رفع شدند!

source: Permission fix failed
fa_ir: رفع مجوزها ناموفق بود

source: Permission fix error
fa_ir: خطای رفع مجوزها

source: Processing...
fa_ir: در حال پردازش...

source: Pulling repository...
fa_ir: در حال پول مخزن...

source: Pushing repository...
fa_ir: در حال پوش مخزن...

source: Fetching repository...
fa_ir: در حال دریافت مخزن...

source: Personal Access Token Guide
fa_ir: راهنمای توکن دسترسی شخصی

source: Unknown error
fa_ir: خطای نامشخص

source: Unable to parse Git URL. Please check the format and try again.
fa_ir: تجزیه آدرس گیت ناموفق بود. لطفاً فرمت را بررسی کرده و دوباره تلاش کنید.

source: Uncommitted Changes
fa_ir: تغییرات کامیت نشده

source: You have uncommitted changes. Consider committing them to keep your repository clean.
fa_ir: شما تغییرات کامیت نشده‌ای دارید. برای تمیز نگه داشتن مخزن خود، آن‌ها را کامیت کنید.

source: Behind Remote
fa_ir: پشت ریموت

source: Your local branch is {count} commit(s) behind the remote. Consider pulling the latest changes.
fa_ir: برنچ محلی شما {count} کامیت از ریموت عقب‌تر است. پول آخرین تغییرات را در نظر بگیرید.

source: Ahead of Remote
fa_ir: جلوتر از ریموت

source: Your local branch is {count} commit(s) ahead of the remote. Consider pushing your changes.
fa_ir: برنچ محلی شما {count} کامیت از ریموت جلوتر است. پوش تغییرات خود را در نظر بگیرید.

source: Your repository is clean and up to date with the remote.
fa_ir: مخزن شما تمیز و به‌روز با ریموت است.

source: Repository is behind remote by {count} commit(s).
fa_ir: مخزن {count} کامیت از ریموت عقب‌تر است.

source: Repository is ahead of remote by {count} commit(s).
fa_ir: مخزن {count} کامیت از ریموت جلوتر است.

source: Add Repository (Ctrl+N)
fa_ir: افزودن مخزن (Ctrl+N)

source: Toggle Theme (Ctrl+T)
fa_ir: تغییر پوسته (Ctrl+T)

source: Error saving repository settings:
fa_ir: خطا در ذخیره تنظیمات مخزن:

source: Floating Widget Settings
fa_ir: تنظیمات ویجت شناور

source: Control the floating widget and its notifications behavior
fa_ir: کنترل ویجت شناور و رفتار اعلان‌های آن

source: Enable floating widget
fa_ir: فعال‌سازی ویجت شناور

source: Show the floating Git Manager widget on all admin pages for quick repository access.
fa_ir: نمایش ویجت شناور مدیر گیت در تمام صفحات مدیریت برای دسترسی سریع به مخزن.

source: Enable floating widget notifications
fa_ir: فعال‌سازی اعلان‌های ویجت شناور

source: Show notifications from the floating widget for repository status updates and actions.
fa_ir: نمایش اعلان‌ها از ویجت شناور برای به‌روزرسانی وضعیت مخزن و اقدامات.

source: Enable repository status notifications
fa_ir: فعال‌سازی اعلان‌های وضعیت ریپازیتوری

source: Show notifications for repository updates like new commits, branch changes, and status changes.
fa_ir: نمایش اعلان‌ها برای به‌روزرسانی‌های ریپازیتوری مانند کامیت‌های جدید، تغییرات برنچ و تغییرات وضعیت.

source: Configure your Git Manager experience
fa_ir: تجربه مدیر گیت خود را پیکربندی کنید

source: Access denied.
fa_ir: دسترسی رد شد.
